// TermsPage.jsx

import React from "react";

const TermsPage = () => {
    return (
        <div style={{margin:'30px 0'}}>
            <h2>서비스 이용약관</h2>

            <section>
                <h3>1. 서비스의 정의</h3>
                <p>
                    파워레인조(이하 "회사")는 영화 정보 허브 서비스(이하 "서비스")를 제공합니다.
                    서비스 이용 시에는 본 이용약관에 동의하는 것으로 간주됩니다.
                </p>
            </section>

            <section>
                <h3>2. 이용자의 권리와 의무</h3>
                <p>
                    2.1. 서비스를 이용하는 모든 사용자(이하 "이용자")는 본 약관에 따라 서비스를 이용할 권리를 가집니다.
                </p>
                <p>
                    2.2. 이용자는 서비스를 이용함에 있어 다음과 같은 행동을 하지 않아야 합니다.
                    - 불법적인 목적으로 서비스를 이용하는 행위
                    - 타인의 개인정보를 수집, 저장, 공개하는 행위
                    - 서비스의 안정성을 해치는 행위
                    - 기타 법률에 위반되거나 공서양속에 반하는 행위
                </p>
            </section>

            <section>
                <h3>3. 회사의 권리와 의무</h3>
                <p>
                    3.1. 회사는 서비스의 운영, 유지, 개선을 위해 노력합니다.
                </p>
                <p>
                    3.2. 서비스의 제공은 회사의 사정에 따라 변경, 중단될 수 있습니다.
                </p>
            </section>

            <section>
                <h3>4. 개인정보 보호</h3>
                <p>
                    4.1. 회사는 이용자의 개인정보를 적절하게 보호하며, 개인정보 처리에 대한 규정은 개인정보 처리방침에서 정의됩니다.
                </p>
            </section>

            <section>
                <h3>5. 지적재산권</h3>
                <p>
                    5.1. 서비스에 포함된 콘텐츠의 지적재산권은 회사에 속합니다.
                    이용자는 회사의 허락 없이 콘텐츠를 복제, 수정, 배포할 수 없습니다.
                </p>
            </section>

            <section>
                <h3>6. 책임의 한계</h3>
                <p>
                    6.1. 회사는 서비스의 이용으로 인해 발생하는 문제에 대한 어떠한 책임도 지지 않습니다.
                </p>
                <p>
                    6.2. 이용자는 서비스 이용 시 발생한 문제의 책임을 지며,
                    회사에게 손해를 끼치지 않아야 합니다.
                </p>
            </section>

            <section>
                <h3>7. 이용약관의 변경</h3>
                <p>
                    7.1. 회사는 필요에 따라 이용약관을 변경할 수 있습니다.
                    변경된 내용은 서비스 내 공지사항을 통해 이용자에게 통보됩니다.
                </p>
            </section>

            <section>
                <h3>8. 관할 법원</h3>
                <p>본 이용약관에 관한 소송은 대한민국의 관할 법원에서</p>
            </section>
        </div>
    );
}


export default TermsPage;
